//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file		BGMSheetController.cs
//!
//! @summary	BGMシートに関するC#スクリプト
//!
//! @date		2019.11.07
//!
//! @author		深草直斗
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 名前空間の省略 ===========================================================
using System.Collections;
using System.Collections.Generic;
using UnityEngine;


// クラスの定義 =============================================================
public class BGMSheetController : MonoBehaviour
{
	// メンバ関数の定義 =====================================================
	#region 曲選択ボタンが押された時の処理
	//-----------------------------------------------------------------
	//! @summary   曲選択ボタンが押された時の処理
	//!
	//! @parameter [void] なし
	//!
	//! @return    なし
	//-----------------------------------------------------------------
	public void OnClickSelectButton()
	{

	}
	#endregion

	#region 曲の開始時間が入力された時の処理
	//-----------------------------------------------------------------
	//! @summary   曲の開始時間が入力された時の処理
	//!
	//! @parameter [void] なし
	//!
	//! @return    なし
	//-----------------------------------------------------------------
	public void OnEndEditStartTimeInputField()
	{

	}
	#endregion

	#region 曲の終了時間が入力された時の処理
	//-----------------------------------------------------------------
	//! @summary   曲の終了時間が入力された時の処理
	//!
	//! @parameter [void] なし
	//!
	//! @return    なし
	//-----------------------------------------------------------------
	public void OnEndEditEndTimeInputField()
	{

	}
	#endregion
}
